Repository: cracklib/cracklib
Catalog: src/po/*.po
Languages: et, hu, ka, ko

source: it is based on your username
et: põhineb sinu kasutajanimel
hu: a felhasználónevén alapszik
ka: ეყდრნობა მომხმარებლის თქვენს სახელს
ko: 사용자 이름을 기반으로 합니다

source: it is based upon your password entry
et: põhineb sinu salasõnal
hu: a jelszóbejegyzésén alapszik
ka: ეყრდნობა თქვენს პაროლს
ko: 자신의 비밀번호 항목을 기반으로 합니다

source: it is derived from your password entry
et: on tuletatud sinu salasõnast
hu: a jelszóbejegyzéséből lett származtatva
ka: მიღებულია პაროლის თქვენი ჩანაწერისგან
ko: 비밀번호 항목에서 파생됩니다

source: it is derivable from your password entry
et: on tuletatav sinu salasõnast
hu: kitalálható a jelszóbejegyzéséből
ka: მიღებადია პაროლის თქვენი ჩანაწერიდან
ko: 비밀번호 항목에서 파생됩니다

source: it's derivable from your password entry
et: on tuletatav sinu salasõnast
hu: kitalálható a jelszóbejegyzéséből
ka: მიღებადია პაროლის თქვენი ჩანაწერიდან
ko: 비밀번호 항목에서 파생됩니다

source: you are not registered in the password file
et: sa pole kirjas salasõnade failis
hu: nincs regisztrálva a jelszófájlban
ka: პაროლების ფაილში რეგისტრირებული არ ბრძანდებით
ko: 비밀번호 파일에 등록되어 있지 않습니다

source: it is WAY too short
et: on LIIGA lühike
hu: NAGYON rövid
ka: ძალიან მოკლეა
ko: 너무 짧습니다

source: it is too short
et: on lühikesepoolne
hu: túl rövid
ka: ძალიან მოკლეა
ko: 너무 짧습니다

source: it does not contain enough DIFFERENT characters
et: ei sisalda piisavalt palju ERINEVAID tähemärke
hu: nem tartalmaz elegendő számú KÜLÖNBÖZŐ karaktert
ka: არ შეიცავს საკმარის განსხვავებულ სიმბოლოს
ko: 다른 문자가 충분히 포함되어 있지 않습니다

source: it is all whitespace
et: koosneb vaid tühikutest
hu: csak üres karakterekből áll
ka: სულ გამოტოვებული ადგილია
ko: 모두 여백입니다

source: it is too simplistic/systematic
et: on liiga lihtne/süsteemipärane
hu: túl egyszerű vagy szisztematikus
ka: ძალიან მარტივი/სისტემატურია
ko: 너무 단순/체계적입니다

source: it looks like a National Insurance number.
et: näeb vägagi inglise rahvusliku kindlustustunnuse moodi välja.
hu: úgy néz ki, mint egy TAJ-szám
ka: წააგავს ნაციონალურ დაზღვევის ნომერს.
ko: 국민 보험 번호와 유사합니다.

source: it is based on a dictionary word
et: põhineb sõnastiku sissekandel
hu: szótári szón alapszik
ka: ეყრდნობა ჩვეულებრივ სიტყვას
ko: 사전에 있는 단어를 기반으로 합니다

source: it is based on a (reversed) dictionary word
et: põhineb (tagurpidi kirjutatud) sõnastiku sissekandel
hu: (megfordított) szótári szón alapszik
ka: ეყრდნობა შებრუნებულ ჩვეულებრივ სიტყვას
ko: (역순) 사전에 있는 단어를 기반으로 합니다

source: error loading dictionary
et: viga sõnastiku laadimisel
hu: hiba a szótár betöltésekor
ka: ლექსიკონის ჩატვირთვის შეცდომა
ko: 사전을 적재하는 중 오류 발생
